/* jshint esversion: 6 */

export default {
    //系统错误
    SYSTEM_ERROR: {
        DEFAULT: '未知错误',
        '999': '未知错误',
        '800': '数据保存失败',
        '801': '数据修改失败',
        '802': '数据删除失败',
        '803': '数据查询失败',
        '804': '【804】违反数据唯一约束',
        '810': '【810】登录会话已过期，请重新登录',
        '811': '【811】用户未登录',
        '812': '【812】用户权限不足',
        '813': '【813】验证码错误',
        '830': '【830】抱歉，系统服务繁忙，请稍后重试！',
    },
    //网络错误
    NETWORK_ERROR: {
        DEFAULT: '网络通信异常，请稍后重试',
        '400': '请求参数错误！',
        '401': '权限不足！系统已记录本次操作，请勿尝试越权操作！',
        '403': '禁止访问！',
        '404': '请求地址错误！',
        '500': '抱歉，系统服务繁忙，请稍后重试！',
        '502': '抱歉，系统服务繁忙，请稍后重试！',
        '503': '抱歉，系统服务繁忙，请稍后重试！',
        '504': '请求超时，您的网络环境不稳定，请稍后重试！',
    },
};